Учет_ФК/src/Documents/ПаспортКачестваНаПартиюПродукции/ПаспортКачестваНаПартиюПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПаспортКачестваНаПартиюПродукции</name>
  <registerRecords>InformationRegister.ДанныеПаспортовКачества</registerRecords>
  <attributes>
    <name>ДокументИсследования</name>
    <type>
      <types>DocumentRef.ПроведениеЛабораторныхИсследований</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВыпуска</name>
    <type>
      <types>DocumentRef.ВыпускПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Грузоперевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДоговорГрузоперевозчика</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартияПродукции</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВизаНачальнОТК</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВизаЗаведующийЛабораторией</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Учет_ФК/src/InformationRegisters/ДанныеПаспортовКачества/ДанныеПаспортовКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПаспортовКачества</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПаспортКачества</name>
    <type>
      <types>DocumentRef.ПаспортКачестваНаПартиюПродукции</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>ПартияПродукции</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/Documents/ПаспортКачестваНаПартиюПродукции/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДанныеПаспортовКачества.Записывать = Истина;
	Движение = Движения.ДанныеПаспортовКачества.Добавить();
	Движение.ПартияПродукции 	= ПартияПродукции;
	Движение.ПаспортКачества 	= Ссылка;
	Движение.Контрагент 		= Контрагент;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию(ПараметрыСеанса.ТекущийПользователь.Наименование);
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры
